<!DOCTYPE html>
<html lang="th">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>ยืนยันการลงทะเบียน</title>
    <link href="https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css" rel="stylesheet" />
    <link href="https://cdnjs.cloudflare.com/ajax/libs/font-awesome/6.5.0/css/all.min.css" rel="stylesheet" />
    <style>
    body {
        font-family: sans-serif;
        background: #fff;
        padding: 1.5rem;
        text-align: center;
    }

    h2 {
        margin-bottom: 30px;
        font-size: 2rem;
        margin-top: 0px;
    }

    .login-box {
        background: #3498db;
        padding: 30px;
        border-radius: 15px;
        color: white;
        margin: 0 auto;
        display: block;
    }

    p {
        font-weight: 500;
    }

    .btn-light {
        border-radius: 15px;
    }

    @media (max-width: 480px) {
        h2 {
            font-size: 1.5rem;
        }
    }
    </style>
</head>

<body>
    <div class="container">
        <div class="login-box">
            <h5>ข้อกำหนดและเงื่อนไขการให้บริการ (Terms of Service)</h5><br>
            <div class="terms-text" style="text-align: left; font-size: 1rem; line-height: 1.7;">
                <p>เว็บไซต์ผู้บริการ การติดต่อผ่าน Messaging Apps หรือช่องทางการให้บริการอื่นใด (รวมเรียกว่า
                    <strong>“ช่องทางการให้บริการ”)</strong> เว็บไซต์ผู้บริการผู้ให้บริการ
                    โดยมีวัตถุประสงค์เพื่อการให้บริการคำปรึกษาทางจิตวิทยา อีกทั้งยังเป็นการอำนวยความสะดวกในการใช้บริการ
                    รวมถึงใช้งานผลิตภัณฑ์ต่าง ๆ ที่อาจมีขึ้นในอนาคตของเว็บไซต์ผู้บริการผู้ให้บริการ</>

                <p>ผู้รับบริการตกลงยอมรับข้อตกลงและเงื่อนไขการใช้บริการต่าง ๆ ที่กำหนดไว้
                    ย่อมก่อให้เกิดความผูกพันตามข้อตกลงและเงื่อนไขการใช้บริการทั้งหมด
                    ซึ่งผู้รับบริการได้อ่านและทำความเข้าใจในข้อตกลงและเงื่อนไขการใช้บริการแล้ว
                    ผู้รับบริการยอมรับและตกลงที่จะผูกพันกับข้อตกลงและเงื่อนไขการใช้บริการเหล่านี้
                    หากผู้รับบริการไม่ยอมรับหรือไม่สามารถปฏิบัติตามข้อตกลงและเงื่อนไขการใช้บริการนี้
                    ผู้รับบริการจะไม่สามารถใช้งานช่องทางการให้บริการของเว็บไซต์ผู้บริการผู้ให้บริการ
                    หรือเข้าถึงเนื้อหาใด ๆ ได้</p>

                <p>ผู้รับบริการสมัครใจและตกลงของให้ข้อมูลของผู้รับบริการให้แก่ (ชื่อเว็บไซต์ผู้บริการ)ในการเก็บรวบรวม
                    ใช้ และ/หรือ เปิดเผยข้อมูลส่วนบุคคลของผู้รับบริการ ภายใต้ พระราชบัญญัติคุ้มครองข้อมูลส่วนบุคคล พ.ศ.
                    2562 (และตามที่ได้มีการแก้ไขเพิ่มเติม รวมถึงประกาศที่ออกตามพระราชบัญญัติดังกล่าว)
                    และประกาศความเป็นส่วนตัว (Privacy Notice) ของเว็บไซต์ผู้บริการ
                    และผู้รับบริการยืนยันว่าข้อมูลที่ผู้รับบริการได้ให้แก่เว็บไซต์ผู้บริการมีความ ถูกต้อง เป็นปัจจุบัน
                    สมบูรณ์ และไม่ก่อให้เกิดความเข้าใจผิด โดยมีรายละเอียด ดังต่อไปนี้</p>

                <p>&emsp;1. ผู้ใช้บริการตกลงและยินยอมให้เว็บไซต์ผู้ให้บริการเก็บ รวบรวม ใช้
                    และเปิดเผยได้ภายใต้ขอบเขตแห่งวัตถุประสงค์ที่กฎหมายอนุญาตไว้
                    เพื่อประมวลผลข้อมูลส่วนบุคคลของผู้ใช้บริการ และวัตถุประสงค์ในการให้บริการคำปรึกษาทางจิตวิทยา
                    รวมถึงการปรับปรุงคุณภาพการให้บริการ ทั้งนี้
                    ผู้ให้บริการจะดำเนินการตามกฎหมายคุ้มครองข้อมูลส่วนบุคคลอย่างเคร่งครัด
                    และจะไม่เปิดเผยข้อมูลแก่บุคคลภายนอก เว้นแต่จะได้รับความยินยอมจากผู้ใช้บริการ
                    หรือมีคำสั่งตามกฎหมายบังคับ</p>

                <p>&emsp;ผู้รับบริการตกลงและยอมรับว่าข้อมูลส่วนบุคคลของผู้รับบริการทั้งหมดที่เว็บไซต์ผู้บริการรวบรวมได้จากการให้ข้อมูลของผู้รับบริการ
                    อาจถูกใช้และถูกเปิดเผยต่อบุคคลอื่นและเพื่อวัตถุประสงค์
                    ตามที่ระบุอยู่ในนโยบายความเป็นส่วนตัวของเว็บไซต์ผู้ให้บริการ เช่นแต่ไม่จำกัดเพียงแต่
                    เว็บไซต์ผู้ให้บริการอาจจะใช้ข้อมูลที่เกี่ยวกับผู้รับบริการ รวมถึงที่อยู่ไอพี (IP Address) ชื่อ
                    ที่อยู่ทางไปรษณีย์ ที่อยู่ทางอีเมล์ (E-mail) ของผู้รับบริการและข้อมูลการใช้เว็บไซต์
                    เพื่อดำเนินการตามแผนการรักษาของเว็บไซต์ผู้ให้บริการ</p>

                <p>&emsp;2. ผู้รับบริการยินยอมให้เว็บไซต์ผู้บริการผู้บริการเก็บรวบรวม
                    และใช้ข้อมูลส่วนบุคคลของผู้รับบริการ เพื่อการบำบัด รักษา
                    และการอื่นอันจำเป็นในกระบวนการทำงานของนักจิตวิทยา อำนวยความสะดวกในกระบวนการสรรหา
                    หากไม่สามารถให้ข้อมูลส่วนบุคคลแก่
                    เว็บไซต์ผู้บริการผู้บริการอาจเสียสิทธิได้รับข้อมูลข่าวสารหรือสิทธิประโยชน์ รวมถึงการติดต่อจาก
                    เว็บไซต์ผู้บริการ อันเกี่ยวกับการติดตามผลการรักษา </p>

                <p>&emsp;3. ผู้รับบริการยินยอมให้เว็บไซต์ผู้บริการเปิดเผยข้อมูลส่วนบุคคลให้แค่ พนักงาน ลูกจ้าง
                    ผู้รับมอบอำนาจ ผู้มีส่วนได้เสียตามกฎหมาย และตามคำสั่งศาล</p>

                <p>&emsp;4. ผู้ใช้บริการรับทราบและยินยอมว่า เนื้อหาทั้งหมดที่เกิดขึ้นระหว่างการให้คำปรึกษา
                    รวมถึงข้อมูลที่ผู้ใช้บริการเปิดเผยต่อผู้ให้บริการ ถือเป็นความลับส่วนบุคคล
                    ผู้ให้บริการมีหน้าที่ในการรักษาความลับดังกล่าวอย่างเคร่งครัด และจะไม่เปิดเผยต่อบุคคลภายนอก
                    เว้นแต่จะได้รับความยินยอมเป็นลายลักษณ์อักษรจากผู้ใช้บริการ หรือมีเหตุอันจำเป็นตามกฎหมาย</p>

                <p>&emsp;5. บรรดาเอกสาร ข้อมูล วัตถุอื่นใด รวมถึงแต่ไม่จำกัดเฉพาะข้อความ ซอฟต์แวร์ สคริปต์ รหัส
                    การออกแบบ กราฟิก ภาพถ่าย เสียง วิดีโอ แอพพลิเคชัน คุณลักษณะการโต้ตอบ และเนื้อหาอื่น ๆ ทั้งหมด
                    <strong>(“เนื้อหา”)</strong> ทรัพย์สินทางปัญญาทั้งหมด เป็นของเว็บไซต์ผู้บริการ
                    ซึ่งครอบคลุมถึงสิ่งต่าง ๆ ที่ได้รับการคุ้มครองโดยลิขสิทธิ์ เครื่องหมายการค้า หรือกฎหมายสิทธิบัตร
                    เครื่องหมายการค้า เครื่องหมายการบริการ และชื่อทางการค้า
                    ไม่ว่าจะได้รับการรับรองหรือจดทะเบียนแล้วหรือไม่
                    โดยเนื้อหาทั้งหมดเป็นทรัพย์สินที่เป็นกรรมสิทธิ์ของเว็บไซต์ผู้บริการ
                    และเว็บไซต์ผู้บริการขอสงวนลิขสิทธิ์ทั้งสิ้น</p>

                <p>&emsp;6. ข้อมูล ข่าวสาร เนื้อหา และความเห็นซึ่งมีอยู่หรือสามารถหาได้ผ่านทางช่องการให้บริการ
                    เป็นข้อมูลที่เว็บไซต์ผู้บริการได้พยายามจัดหามาด้วยความระมัดระวัง จากแหล่งข้อมูลต่าง ๆ
                    ซึ่งเป็นที่ยอมรับกันโดยทั่วไปว่ามีความน่าเชื่อถือ แต่ทั้งนี้มิได้หมายความว่า
                    เว็บไซต์ผู้บริการได้รับรองโดยชัดแจ้งหรือโดยปริยายว่าข้อมูลที่ปรากฏอยู่บนช่องทางการให้บริการทั้งหมดดังกล่าวนี้
                    มีความถูกต้องสมบูรณ์และน่าเชื่อถือแต่อย่างใด โดยอาจไม่ถูกต้องหรือมีความผิดพลาดในการพิมพ์
                    ทั้งนี้ช่องทางการให้บริการ
                    และเนื้อหาที่อยู่ในช่องทางการให้บริการจะได้รับการเปลี่ยนแปลงอยู่เสมอเป็นระยะ เว็บไซต์ผู้บริการ
                    และผู้รับจ้าง จะไม่รับผิดชอบต่อคุณหรือบุคคลใด ๆ ในความเสียหายที่เกิดขึ้น ไม่ว่าโดยทางตรงหรือทางอ้อม
                    จากการใช้เนื้อหาบนเว็บไซต์นี้ไม่ว่าด้วยเหตุใด ๆ ซึ่งรวมถึง การที่เนื้อหานั้นไม่ถูกต้อง ผิดพลาด
                    ไม่ครบถ้วน ไม่เป็นไปตามเวลาไม่สมบูรณ์ ถูกลบ ถูกแก้ไข มีข้อบกพร่อง ไม่สามารถแสดงผล
                    หรือความขัดข้องของระบบสื่อสาร</p>

                <p>&emsp;7. ผู้ใช้บริการตกลงว่าจะไม่กระทำการใด ๆ อันเป็นการเผยแพร่เนื้อหา บันทึกเสียง บันทึกภาพ
                    หรือแสดงความคิดเห็นในลักษณะที่เป็นการละเมิดความลับของการให้บริการ หรือสร้างความเสียหายต่อชื่อเสียง
                    หรือภาพลักษณ์ของผู้ให้บริการ ไม่ว่าทางตรงหรือทางอ้อม ผ่านช่องทางสื่อสังคมออนไลน์หรือสื่ออื่นใดก็ตาม
                    โดยหากฝ่าฝืน ผู้ใช้บริการตกลงรับโทษตามประมวลกฎหมายแพ่งและพาณิชย์ และประมวลกฎหมายอาญา ทั้งนี้
                    ไม่เป็นการตัดสิทธิผู้ให้บริการในการเรียกร้องค่าเสียหายเพิ่มเติมตามที่เกิดขึ้นจริง
                    หรือดำเนินคดีตามกฎหมายอื่นที่เกี่ยวข้อง</p>

                <p>&emsp;8.
                    ผู้ให้บริการไม่รับประกันว่าการให้คำปรึกษาจะสามารถแก้ไขหรือรักษาสภาวะทางจิตใจของผู้ใช้บริการได้โดยสมบูรณ์
                    ทั้งนี้ ผลลัพธ์ขึ้นอยู่กับปัจจัยส่วนบุคคล
                    และการมีส่วนร่วมของผู้ใช้บริการในการดูแลตนเองอย่างต่อเนื่อง</p>

                <p>&emsp;9. การเริ่มใช้บริการถือว่าผู้ใช้บริการได้อ่าน ทำความเข้าใจ
                    และตกลงยินยอมในเงื่อนไขข้างต้นทุกประการโดยไม่มีข้อสงวนใด ๆ</p>

                <p>&emsp;ผู้รับบริการได้อ่านและรับทราบข้อตกลงยินยอมในการเข้ารับบริการ ของเว็บไซต์ผู้บริการแล้ว
                    ผู้รับบริการยินยอมให้ เว็บไซต์ผู้บริการ ดำเนินการเก็บรวบรวม ใช้ และ/หรือ เปิดเผยข้อมูลส่วนบุคคล
                    ตามรายละเอียดที่ระบุข้างต้น</p>
            </div>



            <form method="POST" action="db_register.php">
                <input type="hidden" name="fullname" value="<?php echo htmlspecialchars($_GET['fullname']); ?>">
                <input type="hidden" name="username" value="<?php echo htmlspecialchars($_GET['username']); ?>">
                <input type="hidden" name="email" value="<?php echo htmlspecialchars($_GET['email']); ?>">
                <input type="hidden" name="password" value="<?php echo htmlspecialchars($_GET['password']); ?>">
                <input type="hidden" name="confirm_password"
                    value="<?php echo htmlspecialchars($_GET['confirm_password']); ?>">

                <div>
                    <button class="btn btn-light me-3" style="margin-right: 20px;" type="submit">ยินยอม</button>
                    <button class="btn btn-light" type="button"
                        onclick="window.location.href='index.php'">ไม่ยินยอม</button>
                </div>
            </form>
        </div>
    </div>

    <script src="https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/js/bootstrap.bundle.min.js"></script>
</body>

</html>